tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
# Command-line fuzzy finder written in Go
# brew "fzf"
# GitHub command-line tool
# brew "gh"
# Open source programming language to build simple/reliable/efficient software
# brew "go"
# Tools and libraries to manipulate images in many formats
# brew "imagemagick"
# Simple terminal UI for git commands
# brew "lazygit"
brew "neovim"
# Platform built on V8 to build network applications
brew "nushell"
# Create, run, and share large language models (LLMs)
# brew "ollama"
# Package compiler and linker metadata toolkit
brew "speedtest-cli"
# Cross-shell prompt for astronauts
# brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Internet file retriever
brew "wget"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Chromium based browser
cask "arc"
# Multi-track audio editor and recorder
cask "audacity"
# 3D creation suite
# cask "blender"
# Utility that prevents the system from going to sleep
cask "caffeine"
# Mounts cloud storages as local discs
# cask "cloudmounter"
# Write, edit, and chat about your code with AI
# cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
# cask "font-meslo-lg-nerd-font"
# Utility to hide menu bar items
cask "hiddenbar"
# Software for Logitech devices
# cask "logi-options+"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Home media player
cask "plex"
# Control your tools with a few keystrokes
cask "raycast"
# RØDE companion app
cask "rode-central"
# Video chat, voice call and instant messaging application
cask "skype"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
